In [2]:
import pymysql as pt

ModuleNotFoundError: No module named 'pymysql'

In [3]:
pip install PyMySQL

Collecting PyMySQL
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: PyMySQL
Successfully installed PyMySQL-1.1.1
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pymysql as pt

In [6]:
conn = pt.connect(user='root',
           password="1234",
          host="localhost",
          autocommit = True,
          )
print("it is connected")

it is connected

In [22]:
cur = conn.cursor()
print("done")

done

In [29]:
query = ''' use parth1;
'''

In [30]:
cur.execute(query)
print("done")

done

In [33]:
query = '''create table student_details
(
SID int not null,
s_name varchar(50),
course varchar(50),
Address varchar(80),
Scholorship float
); '''

In [34]:
cur.execute(query)
print("done")

done

In [35]:
query = ''' insert into student_details
values
(101,"parth","bca","shakarpur",100000),
(102,"prateek","bba","shakarpur",11000);
'''

In [36]:
cur.execute(query)
print("done")

done

In [43]:
for i in range(5):
    sid = int(input("enter the id"))
    name = input("enter the name")
    course = input("enter the course")
    address = input("enter the address")
    scholorship = int(input("enter the amount"))
    
    query2 = f'''insert into student_details values
    ({sid},"{name}","{course}","{address}",{scholorship});
    '''
    cur.execute(query2)
print("done")

enter the id 071
enter the name tyagi
enter the course bca
enter the address ip
enter the amount 10000
enter the id 080
enter the name rohan
enter the course bca
enter the address ip
enter the amount 100000
enter the id 890
enter the name youri
enter the course bba
enter the address ip
enter the amount 10000
enter the id 876
enter the name booker
enter the course bca
enter the address ip
enter the amount 10000
enter the id 860
enter the name ashmeeet
enter the course bba
enter the address ip
enter the amount 10000

done

In [60]:
query3 = '''select * from student_details;'''
cur.execute(query3)
columms1 = []
r = cur.fetchall()
for i in cur.description:
    columms1.append(i[0])
import pandas as pd
pd.DataFrame(r, columns = columms1)

    SID    s_name  course    Address  Scholorship
0   101     parth     bca  shakarpur     100000.0
1   102   prateek     bba  shakarpur      11000.0
2    71     parth     bca  shakarpur      10000.0
3    91     manan     bca         ip     100000.0
4    85     sdjfs  fjksfj     jfksjf    3423420.0
5   343   hareker     bba      shakr      43434.0
6   243    gaurav     bba       sfsf      11342.0
7    71     tyagi     bca         ip      10000.0
8    80     rohan     bca         ip     100000.0
9   890     youri     bba         ip      10000.0
10  876    booker     bca         ip      10000.0
11  860  ashmeeet     bba         ip      10000.0

In [67]:
def show_records(db,table):
        
    query3 = f''' select * from {db}.{table};'''
    cur.execute(query3)
    columms1 = []
    r = cur.fetchall()
    for i in cur.description:
        columms1.append(i[0])
    import pandas as pd
    df = pd.DataFrame(r, columns = columms1)
    return df

In [68]:
show_records('parth1','student_details')

    SID    s_name  course    Address  Scholorship
0   101     parth     bca  shakarpur     100000.0
1   102   prateek     bba  shakarpur      11000.0
2    71     parth     bca  shakarpur      10000.0
3    91     manan     bca         ip     100000.0
4    85     sdjfs  fjksfj     jfksjf    3423420.0
5   343   hareker     bba      shakr      43434.0
6   243    gaurav     bba       sfsf      11342.0
7    71     tyagi     bca         ip      10000.0
8    80     rohan     bca         ip     100000.0
9   890     youri     bba         ip      10000.0
10  876    booker     bca         ip      10000.0
11  860  ashmeeet     bba         ip      10000.0

In [70]:
conn.close()